Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.SetValueAsXYZ(Autodesk.Revit.DB.XYZ)
Sets the value property as a vector or point XYZ.
xyz:
The new value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value is invalid for this AssetPropertyDoubleArray3d property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.IsValidValue(Autodesk.Revit.DB.XYZ)
Checks that the value is a valid value for this property.
xyz:
The value to be checked.
Returns:
True if the value is valid for the property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.GetValueAsXYZ
Get the value property as a vector or point XYZ.

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.GetValueAsDoubles
Get the value property as doubles.

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
Represents a vector or point property.